In [1]:
import pandas as pd

In [3]:
import numpy as np

In [23]:
data = np.random.randn(4,3)

In [24]:
data

array([[-1.81706793, -0.63452185, -0.89312045],
       [-0.9548384 , -1.47093622,  0.21506756],
       [-0.90567863,  1.39605635,  0.04513854],
       [ 1.09379995,  0.32215144,  0.17740181]])

In [25]:
data_frame = pd.DataFrame(data)

In [26]:
data_frame

          0         1         2
0 -1.817068 -0.634522 -0.893120
1 -0.954838 -1.470936  0.215068
2 -0.905679  1.396056  0.045139
3  1.093800  0.322151  0.177402

In [27]:
type(data_frame)

pandas.core.frame.DataFrame

In [28]:
data_frame[0]

0   -1.817068
1   -0.954838
2   -0.905679
3    1.093800
Name: 0, dtype: float64

In [29]:
type(data_frame[0])

pandas.core.series.Series

In [30]:
new_df = pd.DataFrame(data, index= ["Busra","Zeynep","Atlas","Mehmet"], columns=["Salary","Age","Seniority"])

In [31]:
new_df

          Salary       Age  Seniority
Busra  -1.817068 -0.634522  -0.893120
Zeynep -0.954838 -1.470936   0.215068
Atlas  -0.905679  1.396056   0.045139
Mehmet  1.093800  0.322151   0.177402

In [32]:
new_df["Age"]

Busra    -0.634522
Zeynep   -1.470936
Atlas     1.396056
Mehmet    0.322151
Name: Age, dtype: float64

In [33]:
new_df["Seniority"]

Busra    -0.893120
Zeynep    0.215068
Atlas     0.045139
Mehmet    0.177402
Name: Seniority, dtype: float64

In [34]:
new_df[["Age","Seniority"]]

             Age  Seniority
Busra  -0.634522  -0.893120
Zeynep -1.470936   0.215068
Atlas   1.396056   0.045139
Mehmet  0.322151   0.177402

In [35]:
new_df.loc["Busra"]

Salary      -1.817068
Age         -0.634522
Seniority   -0.893120
Name: Busra, dtype: float64

In [36]:
new_df.iloc[0]

Salary      -1.817068
Age         -0.634522
Seniority   -0.893120
Name: Busra, dtype: float64

In [38]:
new_df.iloc[:,1] # Bütün rowları seç ve 1 sütunu getir

Busra    -0.634522
Zeynep   -1.470936
Atlas     1.396056
Mehmet    0.322151
Name: Age, dtype: float64

In [52]:
new_df["Extra"] = 10 # Kolon ekleme

In [53]:
new_df

          Salary       Age  Seniority  Extra
Busra  -1.817068 -0.634522  -0.893120     10
Zeynep -0.954838 -1.470936   0.215068     10
Atlas  -0.905679  1.396056   0.045139     10
Mehmet  1.093800  0.322151   0.177402     10

In [54]:
new_df.drop("Extra", axis=1) # Kolon Silme

          Salary       Age  Seniority
Busra  -1.817068 -0.634522  -0.893120
Zeynep -0.954838 -1.470936   0.215068
Atlas  -0.905679  1.396056   0.045139
Mehmet  1.093800  0.322151   0.177402

In [55]:
new_df

          Salary       Age  Seniority  Extra
Busra  -1.817068 -0.634522  -0.893120     10
Zeynep -0.954838 -1.470936   0.215068     10
Atlas  -0.905679  1.396056   0.045139     10
Mehmet  1.093800  0.322151   0.177402     10

In [56]:
new_df.drop("Extra",axis=1,inplace=True) # inplace = içinde bunu yap olanı bu hale getir

In [58]:
new_df["Mehmet"] = 10

In [59]:
new_df

          Salary       Age  Seniority  Mehmet
Busra  -1.817068 -0.634522  -0.893120      10
Zeynep -0.954838 -1.470936   0.215068      10
Atlas  -0.905679  1.396056   0.045139      10
Mehmet  1.093800  0.322151   0.177402      10

In [60]:
new_df.drop("Mehmet")

          Salary       Age  Seniority  Mehmet
Busra  -1.817068 -0.634522  -0.893120      10
Zeynep -0.954838 -1.470936   0.215068      10
Atlas  -0.905679  1.396056   0.045139      10

In [61]:
new_df

          Salary       Age  Seniority  Mehmet
Busra  -1.817068 -0.634522  -0.893120      10
Zeynep -0.954838 -1.470936   0.215068      10
Atlas  -0.905679  1.396056   0.045139      10
Mehmet  1.093800  0.322151   0.177402      10

In [62]:
new_df.drop("Mehmet",axis=1,inplace=True)

In [63]:
new_df

          Salary       Age  Seniority
Busra  -1.817068 -0.634522  -0.893120
Zeynep -0.954838 -1.470936   0.215068
Atlas  -0.905679  1.396056   0.045139
Mehmet  1.093800  0.322151   0.177402

In [64]:
new_df.drop("Mehmet",axis=0)

          Salary       Age  Seniority
Busra  -1.817068 -0.634522  -0.893120
Zeynep -0.954838 -1.470936   0.215068
Atlas  -0.905679  1.396056   0.045139

In [65]:
new_df.loc["Atlas"]

Salary      -0.905679
Age          1.396056
Seniority    0.045139
Name: Atlas, dtype: float64

In [70]:
new_df.loc["Atlas","Salary"]

np.float64(100.0)

In [71]:
new_df.loc["Atlas","Salary"] = 100

In [72]:
new_df

            Salary       Age  Seniority
Busra    -1.817068 -0.634522  -0.893120
Zeynep   -0.954838 -1.470936   0.215068
Atlas   100.000000  1.396056   0.045139
Mehmet    1.093800  0.322151   0.177402

In [76]:
booleanFrame = new_df > 0

In [77]:
new_df[booleanFrame]

          Salary       Age  Seniority
Busra        NaN       NaN        NaN
Zeynep       NaN       NaN   0.215068
Atlas   100.0000  1.396056   0.045139
Mehmet    1.0938  0.322151   0.177402

In [78]:
new_df[new_df>0]

          Salary       Age  Seniority
Busra        NaN       NaN        NaN
Zeynep       NaN       NaN   0.215068
Atlas   100.0000  1.396056   0.045139
Mehmet    1.0938  0.322151   0.177402

In [79]:
new_df[new_df["Salary"]>1]

          Salary       Age  Seniority
Atlas   100.0000  1.396056   0.045139
Mehmet    1.0938  0.322151   0.177402

In [80]:
new_df

            Salary       Age  Seniority
Busra    -1.817068 -0.634522  -0.893120
Zeynep   -0.954838 -1.470936   0.215068
Atlas   100.000000  1.396056   0.045139
Mehmet    1.093800  0.322151   0.177402

In [81]:
new_df.reset_index()

    index      Salary       Age  Seniority
0   Busra   -1.817068 -0.634522  -0.893120
1  Zeynep   -0.954838 -1.470936   0.215068
2   Atlas  100.000000  1.396056   0.045139
3  Mehmet    1.093800  0.322151   0.177402

In [83]:
new_indices = ["Bus","Zey","Atl","Meh"]

In [84]:
new_df["NewIndex"] = new_indices

In [86]:
new_df

            Salary       Age  Seniority NewIndex
Busra    -1.817068 -0.634522  -0.893120      Bus
Zeynep   -0.954838 -1.470936   0.215068      Zey
Atlas   100.000000  1.396056   0.045139      Atl
Mehmet    1.093800  0.322151   0.177402      Meh

In [87]:
new_df.set_index("NewIndex",inplace=True)

In [88]:
new_df

              Salary       Age  Seniority
NewIndex
Bus        -1.817068 -0.634522  -0.893120
Zey        -0.954838 -1.470936   0.215068
Atl       100.000000  1.396056   0.045139
Meh         1.093800  0.322151   0.177402

In [89]:
new_df.loc["Atl"]

Salary       100.000000
Age            1.396056
Seniority      0.045139
Name: Atl, dtype: float64

In [90]:
#Multi Index

In [91]:
first_index = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [92]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [93]:
zipped_index = list(zip(first_index,inner_index))

In [94]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [95]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [96]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [108]:
sample_values = np.ones((6,2))
sample_values

array([[1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.]])

In [98]:
big_df = pd.DataFrame(sample_values,index = zipped_index,columns = ["Age","Salary"])

In [99]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [100]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [105]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [107]:
big_df.loc["Simpson"].loc["Bart"]

Age       1.0
Salary    1.0
Name: Bart, dtype: float64